# greyvbss
# cilik-userbot

from time import sleep
from userbot import ALIVE_NAME, CMD_HELP, IG_ALIVE, REPO_NAME, GROUP_LINK, bot
from userbot.events import register
from telethon import events
import asyncio


@register(outgoing=True, pattern='^.heu(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("▒▒▒▒▒▄██████████▄▒▒▒▒▒\n"
                     "▒▒▒▄██████████████▄▒▒▒\n"
                     "▒▒██████████████████▒▒\n"
                     "▒▐███▀▀▀▀▀██▀▀▀▀▀███▌▒\n"
                     "▒███▒▒▌■▐▒▒▒▒▌■▐▒▒███▒\n"
                     "▒▐██▄▒▀▀▀▒▒▒▒▀▀▀▒▄██▌▒\n"
                     "▒▒▀████▒▄▄▒▒▄▄▒████▀▒▒\n"
                     "▒▒▐███▒▒▒▀▒▒▀▒▒▒███▌▒▒\n"
                     "▒▒███▒▒▒▒▒▒▒▒▒▒▒▒███▒▒\n"
                     "▒▒▒██▒▒▀▀▀▀▀▀▀▀▒▒██▒▒▒\n"
                     "▒▒▒▐██▄▒▒▒▒▒▒▒▒▄██▌▒▒▒\n"
                     "▒▒▒▒▀████████████▀▒▒▒▒\n")
    
    
@register(outgoing=True, pattern='^.hem(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit(" ╭━┳━╭━╭━╮╮\n"
                     " ┃┈┈┈┣▅╋▅┫┃\n"
                     " ┃┈┃┈╰━╰━━━━━━╮\n"
                     " ╰┳╯┈┈┈┈┈┈┈┈┈◢▉◣\n"
                     "   ╲┃┈┈┈┈┈┈┈┈┈┈▉▉▉\n"
                     "   ╲┃┈┈┈┈┈┈┈┈┈┈◥▉◤\n"
                     "   ╲┃┈┈┈┈╭━┳━━━━╯\n"
                     "   ╲┣━━━━━━┫\n"
                     "      **MENCURIGAKAN**\n")
    

@register(outgoing=True, pattern='^.wle(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("┈╭━━━━━━━━━━━╮┈\n" 
                     "╭╯┈╭━━╮┈╭━━╮┈╰╮\n" 
                     "┃┈┃┃╭╮┃┈┃╭╮┃┃┈┃\n" 
                     "┃┈┃┻┻┻┛┈┗┻┻┻┃┈┃\n" 
                     " ┃┈┃╭╮┈◢▇◣┈╭╮┃┈┃\n" 
                     "╰┳╯┃╰━━┳┳┳╯┃╰┳╯\n" 
                     "┈┃┈╰━━━┫┃┣━╯┈┃┈\n" 
                     "┈┃┈┈┈┈┈╰━╯┈┈┈┃┈\n")
    
    
@register(outgoing=True, pattern='^.peler(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("`MAU LIAT PELER GA???`")
    sleep(1)
    await typew.edit("`NIHHHH DIAA`")
    sleep(1)  
    await typew.edit("░░░░█─────────────█──▀──\n"
                     "░░░░▓█───────▄▄▀▀█──────\n"
                     "░░░░▒░█────▄█▒░░▄░█─────\n"
                     "░░░░░░░▀▄─▄▀▒▀▀▀▄▄▀──SIJONI─\n"
                     "░░░░░░░░░█▒░░░░▄▀────PANJANG\n"
                     "▒▒▒░░░░▄▀▒░░░░▄▀───DAN─\n"
                     "▓▓▓▓▒░█▒░░░░░█▄───PEMBERANI─\n"
                     "█████▀▒░░░░░█░▀▄───CROTT──\n"
                     "█████▒▒░░░▒█░░░▀▄─AHHH──\n"
                     "███▓▓▒▒▒▀▀▀█▄░░░░█──────\n"
                     "▓██▓▒▒▒▒▒▒▒▒▒█░░░░█─────\n"
                     "▓▓█▓▒▒▒▒▒▒▓▒▒█░░░░░█────\n"
                     "░▒▒▀▀▄▄▄▄█▄▄▀░░░░░░░█─\n")
    
    
@register(outgoing=True, pattern='^.ahh(?: |$)(.*)')
async def typewriter(typew):
    typew.pattern_match.group(1)
    await typew.edit("ahhh")
    await typew.edit("ahhh ahhh")
    await typew.edit("ahhh ahhh ahhh")
    await typew.edit("🥵")
    sleep(1)
    await typew.edit("⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⡠⠢⠏⣉⣉⠣⢦⡀⠄⠄⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⠄⠄⠄⠄⣐⢪⠅⣱⣟⢛⢧⠄⣷⠄⠄⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⠄⠠⣬⣀⣢⣕⡽⢯⣩⣳⣷⠧⡆⠄⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⠄⢠⡭⡾⣆⢿⡙⢟⢻⣿⡿⡹⣶⠅⠄⠄⠄ \n"
                     "⠄⠄⠄⠄⠄⠄⠄⣔⠄⡗⢫⠘⠷⠾⠿⠟⠙⣡⢢⢖⠄⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⠄⢫⠺⠁⡹⢸⣿⣿⣿⡟⠲⣦⣌⢄⡇⠄⠄\n"
                     "⠄⠄⠄⠄⠄⠄⢀⡈⢛⠨⠥⡄⣿⣿⣿⣧⢯⡻⡇⠨⣁⠄⠄\n"
                     "⠄⠄⠄⠄⠄⢠⡤⢠⣶⣿⣿⣿⣿⣿⣿⣿⣷⢗⠵⡐⡣⡄⠄\n"
                     "⠄⠄⠄⠄⠄⠸⢡⣿⣿⣿⣿⣿⢿⣿⣿⣿⣿⣷⡄⢶⡇⡇⠄\n"
                     "⠄⠄⠄⠄⠄⣠⣿⣿⣿⣿⣿⠟⢸⣿⣿⣿⡟⡻⣿⠘⠧⡇⠄\n"
                     "⠄⠄⠄⠄⠄⢳⣿⣿⣿⡿⣫⣾⣜⢿⣿⣿⣷⣶⡿⢀⠗⡇⠄\n"
                     "⠄⠄⠄⠄⠄⣦⡝⣭⣵⣾⣿⣿⣿⣦⣍⣛⣛⣫⠡⣼⢾⣿⠄\n"
                     "⠄⠄⠄⠄⢰⣿⡇⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⠄⠨⣿⡟⠄\n"
                     "⠄⠄⠄⢀⣿⡿⣿⢹⣿⣿⣿⣿⣿⣿⣿⣿⣿⣿⢆⣶⣿⠇⠄\n"
                     "⠄⠄⠄⢸⣿⣷⠎⢸⣿⣿⣿⣿⣿⣿⣿⣿⣿⢯⣿⣷⣻⡆⠄\n"
                     "⠄⠄⢀⣿⣿⠏⢸⡟⢿⣿⣿⣸⣿⣿⣿⣿⢏⣾⣿⣿⣏⣷⠄\n"
                     "⠄⠄⣸⣿⠏⢀⣼⣿⣎⡻⢿⣿⣿⣿⠿⣣⣾⣿⣿⣿⣿⣽⠄\n"
                     "⠄⠄⣿⡿⣰⣿⣿⣿⣿⣿ AHHH ⣰⣿⣿⣿⣿⣿⣿⣿\n")
    
   
CMD_HELP.update({
    "animasi":
    ".heu\
\nUsage: Gambar Monyet Besar.\
    \n\n.hem\
\nUsage: Hem Mencurigakan.\
    \n\n.wlee\
\nUsage: Anjing Melet.\
    \n\n.peler\
\nUsage: Gambar Titit.\
    \n\n.ahh\
\nUsage: Aht Ahh Aht."

})

